{
  "model_type": "qwen3_5",
  "architectures": [
    "Qwen3_5ForConditionalGeneration"
  ],
  "text_config": {
    "model_type": "qwen3_5_text",
    "vocab_size": 248320,
    "hidden_size": 4096,
    "num_hidden_layers": 32,
    "num_attention_heads": 16,
    "num_key_value_heads": 4
  },
  "tie_word_embeddings": false,
  "quantization_config": {
    "quant_method": "compressed-tensors",
    "format": "float-quantized",
    "quantization_status": "compressed",
    "version": "0.14.1.a20260325",
    "group_0": {
      "format": "float-quantized",
      "input_activations": {
        "actorder": null,
        "block_structure": null,
        "dynamic": true,
        "group_size": null,
        "num_bits": 8,
        "observer": null,
        "observer_kwargs": {},
        "scale_dtype": null,
        "strategy": "token",
        "symmetric": true,
        "type": "float",
        "zp_dtype": null
      },
      "output_activations": null,
      "targets": [
        "Linear"
      ],
      "weights": {
        "actorder": null,
        "block_structure": null,
        "dynamic": false,
        "group_size": null,
        "num_bits": 8,
        "observer": "memoryless_minmax",
        "observer_kwargs": {},
        "scale_dtype": null,
        "strategy": "channel",
        "symmetric": true,
        "type": "float",
        "zp_dtype": null
      }
    }
  }
}
